In [5]:
from prettytable import PrettyTable, DEFAULT
import pandas

# Verify PrettyTable styles
table = PrettyTable(["Column1", "Column2"])
table.set_style(DEFAULT)  # Check if this works
print(table)

+---------+---------+
| Column1 | Column2 |
+---------+---------+
+---------+---------+

C:\Users\mebub_9a7jdi8\AppData\Local\Temp\ipykernel_19932\2101102897.py:1: DeprecationWarning: the 'DEFAULT' constant is deprecated, use the 'TableStyle' enum instead
  from prettytable import PrettyTable, DEFAULT

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql postgresql://postgres:password@localhost:5432/pizza_sales

### A. KPI's

1. Total Revenue

In [12]:
%%sql
SELECT SUM(total_price) AS Total_Revenue FROM pizza_sales;

 * postgresql://postgres:***@localhost:5432/pizza_sales
1 rows affected.

[(Decimal('817860.05'),)]

2. Average Order Value

In [14]:
%%sql
SELECT (SUM(total_price) / COUNT(DISTINCT order_id)) AS Average_Order_Value FROM pizza_sales;

 * postgresql://postgres:***@localhost:5432/pizza_sales
1 rows affected.

[(Decimal('38.3072622950819672'),)]

3. Total Pizza Sold

In [15]:
%%sql
SELECT SUM(quantity) AS Total_Pizza_Sold FROM pizza_sales;

 * postgresql://postgres:***@localhost:5432/pizza_sales
1 rows affected.

[(49574,)]

4. Total Order

In [19]:
%%sql
SELECT COUNT( DISTINCT order_id) AS Total_Order FROM pizza_sales;

 * postgresql://postgres:***@localhost:5432/pizza_sales
1 rows affected.

[(21350,)]

5. Average pizza per order

In [22]:
%%sql
SELECT * FROM pizza_sales LIMIT 2;

 * postgresql://postgres:***@localhost:5432/pizza_sales
2 rows affected.

[(1, 1, 'hawaiian_m', 1, datetime.date(2015, 1, 1), datetime.time(11, 38, 36), Decimal('13.25'), Decimal('13.25'), 'M', 'Classic', 'Sliced Ham, Pineapple, Mozzarella Cheese', 'The Hawaiian Pizza'),
 (2, 2, 'classic_dlx_m', 1, datetime.date(2015, 1, 1), datetime.time(11, 57, 40), Decimal('16'), Decimal('16'), 'M', 'Classic', 'Pepperoni, Mushrooms, Red Onions, Red Peppers, Bacon', 'The Classic Deluxe Pizza')]

In [24]:
%%sql
SELECT CAST(CAST(SUM(quantity) AS DECIMAL (10,2)) / 
CAST(COUNT(DISTINCT order_id) AS DECIMAL (10,2)) AS DECIMAL(10,2))
AS Avg_Pizzas_per_order
FROM pizza_sales;

 * postgresql://postgres:***@localhost:5432/pizza_sales
1 rows affected.

[(Decimal('2.32'),)]

### B. Daily Trend for Total Orders

In [26]:
%%sql
SELECT TO_CHAR(order_date, 'Day') AS order_day, 
       COUNT(DISTINCT order_id) AS total_orders 
FROM pizza_sales
GROUP BY TO_CHAR(order_date, 'Day');

 * postgresql://postgres:***@localhost:5432/pizza_sales
7 rows affected.

[('Friday   ', 3538),
 ('Monday   ', 2794),
 ('Saturday ', 3158),
 ('Sunday   ', 2624),
 ('Thursday ', 3239),
 ('Tuesday  ', 2973),
 ('Wednesday', 3024)]

### Hourly trend for Orders

In [30]:
%%sql
SELECT EXTRACT(HOUR FROM order_time) as order_hours, 
       COUNT(DISTINCT order_id) as total_orders
FROM pizza_sales
GROUP BY EXTRACT(HOUR FROM order_time)
ORDER BY EXTRACT(HOUR FROM order_time);

 * postgresql://postgres:***@localhost:5432/pizza_sales
15 rows affected.

[(Decimal('9'), 1),
 (Decimal('10'), 8),
 (Decimal('11'), 1231),
 (Decimal('12'), 2520),
 (Decimal('13'), 2455),
 (Decimal('14'), 1472),
 (Decimal('15'), 1468),
 (Decimal('16'), 1920),
 (Decimal('17'), 2336),
 (Decimal('18'), 2399),
 (Decimal('19'), 2009),
 (Decimal('20'), 1642),
 (Decimal('21'), 1198),
 (Decimal('22'), 663),
 (Decimal('23'), 28)]

### % of sales by pizza category

In [31]:
%%sql
SELECT pizza_category, CAST(SUM(total_price) AS DECIMAL(10,2)) as total_revenue,
CAST(SUM(total_price) * 100 / (SELECT SUM(total_price) from pizza_sales) AS DECIMAL(10,2)) AS PCT
FROM pizza_sales
GROUP BY pizza_category

 * postgresql://postgres:***@localhost:5432/pizza_sales
4 rows affected.

[('Supreme', Decimal('208197.00'), Decimal('25.46')),
 ('Chicken', Decimal('195919.50'), Decimal('23.96')),
 ('Veggie', Decimal('193690.45'), Decimal('23.68')),
 ('Classic', Decimal('220053.10'), Decimal('26.91'))]

### % of sales by pizza size

In [34]:
%%sql
SELECT pizza_size, CAST(SUM(total_price) AS DECIMAL(10,2)) as total_revenue,
CAST(SUM(total_price) * 100 / (SELECT SUM(total_price) from pizza_sales) AS DECIMAL(10,2)) AS PCT
FROM pizza_sales
GROUP BY pizza_size
ORDER BY pizza_size

 * postgresql://postgres:***@localhost:5432/pizza_sales
5 rows affected.

[('L', Decimal('375318.70'), Decimal('45.89')),
 ('M', Decimal('249382.25'), Decimal('30.49')),
 ('S', Decimal('178076.50'), Decimal('21.77')),
 ('XL', Decimal('14076.00'), Decimal('1.72')),
 ('XXL', Decimal('1006.60'), Decimal('0.12'))]

### F. Total Pizzas Sold by Pizza Category

In [36]:
%%sql
SELECT pizza_category, SUM(quantity) as Total_Quantity_Sold
FROM pizza_sales
WHERE EXTRACT(MONTH FROM order_date) = 2
GROUP BY pizza_category
ORDER BY Total_Quantity_Sold DESC;

 * postgresql://postgres:***@localhost:5432/pizza_sales
4 rows affected.

[('Classic', 1178), ('Supreme', 964), ('Veggie', 944), ('Chicken', 875)]

### G. Top 5 Best Sellers by Total Pizzas Sold

In [39]:
%%sql
SELECT pizza_name, SUM(quantity) AS Total_Pizza_Sold
FROM pizza_sales
GROUP BY pizza_name
ORDER BY Total_Pizza_Sold DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizza_sales
5 rows affected.

[('The Classic Deluxe Pizza', 2453),
 ('The Barbecue Chicken Pizza', 2432),
 ('The Hawaiian Pizza', 2422),
 ('The Pepperoni Pizza', 2418),
 ('The Thai Chicken Pizza', 2371)]

### H. Bottom 5 Best Sellers by Total Pizzas Sold

In [40]:
%%sql
SELECT pizza_name, SUM(quantity) AS Total_Pizza_Sold
FROM pizza_sales
GROUP BY pizza_name
ORDER BY Total_Pizza_Sold ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizza_sales
5 rows affected.

[('The Brie Carre Pizza', 490),
 ('The Mediterranean Pizza', 934),
 ('The Calabrese Pizza', 937),
 ('The Spinach Supreme Pizza', 950),
 ('The Soppressata Pizza', 961)]